In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#read csv

# specify delimeter
# df = pd.read_csv(filename, sep = ',')

# without header
# df = pd.read_csv(filename, header = None) -> assign default value to column names
# df = pd.read_csv(filename, names = ['a','b','c','d','message']) ->specify column names

# choose index column
# df = pd.read_csv(filename, names = names, index_col='message')

# hierarchical index
# parsed = pd.read_csv(filename, index_col=['key1','key2'])

# skip row
# df = pd.read_csv(filename, skiprows=[0,2,3])

# deal with missing value
# df = pd.read_csv(filename, na_values=['NULL'])
# sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
# df = pd.read_csv(filename, na_values=sentinels)

# TextParser Object
# 
# df = pd.read_csv(filename, chunksize=1000) -> TextParser Object
# tot = Series([])
# for piece in df:
#    tot = tot.add(piece['key'].value_counts(), fill_value=0)

sal

In [4]:
# write csv

# data.to_csv(filename)

# Missing value, instead of empty string, use 'NULL' to represent missing value
#
# data.to_csv(filename, na_rep='NULL')

# disable row and column label
# data.to_csv(filename, index=False, header=False)

In [12]:
#JSON
import json

obj = """ {"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"], "pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
{"name": "Katie", "age": 33, "pet": "Cisco"}]
} """
result = json.loads(obj)
asjson = json.dumps(result)

In [13]:
siblings = DataFrame(result['siblings'], columns=['name','age','pet'])
siblings

    name  age    pet
0  Scott   25   Zuko
1  Katie   33  Cisco

In [18]:
# Interacting with web data
import requests

header = {'User-Agent' : 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.71 Safari/537.36'}   
url = 'https://api.huobi.pro/market/history/kline?period=1min&size=20&symbol=btcusdt'

resp = requests.get(url, headers=header)
resp

In [20]:
json_data = json.loads(resp.text)
json_data

{'ch': 'market.btcusdt.kline.1min',
 'data': [{'amount': 6.3112,
   'close': 16670.0,
   'count': 104,
   'high': 16705.0,
   'id': 1513823400,
   'low': 16670.0,
   'open': 16702.24,
   'vol': 105279.157888},
  {'amount': 5.395480045370994,
   'close': 16702.24,
   'count': 110,
   'high': 16702.24,
   'id': 1513823340,
   'low': 16670.05,
   'open': 16674.38,
   'vol': 89991.17369698056},
  {'amount': 8.454055889204971,
   'close': 16674.58,
   'count': 128,
   'high': 16703.03,
   'id': 1513823280,
   'low': 16674.15,
   'open': 16693.0,
   'vol': 140990.3213267378},
  {'amount': 2.7674,
   'close': 16703.05,
   'count': 74,
   'high': 16703.05,
   'id': 1513823220,
   'low': 16674.07,
   'open': 16689.51,
   'vol': 46204.746667383304},
  {'amount': 3.3467,
   'close': 16689.71,
   'count': 134,
   'high': 16690.02,
   'id': 1513823160,
   'low': 16671.16,
   'open': 16689.95,
   'vol': 55833.019319},
  {'amount': 2.256,
   'close': 16690.0,
   'count': 62,
   'high': 16695.57,
   'id': 1513823100,
   'low': 16672.74,
   'open': 16672.74,
   'vol': 37635.169385},
  {'amount': 5.2786,
   'close': 16672.29,
   'count': 119,
   'high': 16695.63,
   'id': 1513823040,
   'low': 16667.0,
   'open': 16695.26,
   'vol': 88098.433661},
  {'amount': 7.171862730405845,
   'close': 16695.27,
   'count': 148,
   'high': 16695.6,
   'id': 1513822980,
   'low': 16660.19,
   'open': 16695.58,
   'vol': 119555.87038265268},
  {'amount': 4.940849983393409,
   'close': 16695.58,
   'count': 147,
   'high': 16705.54,
   'id': 1513822920,
   'low': 16659.8,
   'open': 16705.52,
   'vol': 82484.48252175625},
  {'amount': 4.1588248698977415,
   'close': 16705.57,
   'count': 98,
   'high': 16736.39,
   'id': 1513822860,
   'low': 16701.0,
   'open': 16701.69,
   'vol': 69502.2036518113},
  {'amount': 2.449612626637089,
   'close': 16701.69,
   'count': 95,
   'high': 16737.79,
   'id': 1513822800,
   'low': 16695.7,
   'open': 16717.87,
   'vol': 40946.103303},
  {'amount': 1.6282651031667397,
   'close': 16737.99,
   'count': 34,
   'high': 16737.99,
   'id': 1513822740,
   'low': 16660.38,
   'open': 16694.78,
   'vol': 27211.237856723754},
  {'amount': 2.639963844895715,
   'close': 16695.63,
   'count': 70,
   'high': 16717.93,
   'id': 1513822680,
   'low': 16660.02,
   'open': 16700.18,
   'vol': 44043.26119403314},
  {'amount': 5.909,
   'close': 16700.18,
   'count': 86,
   'high': 16739.93,
   'id': 1513822620,
   'low': 16700.18,
   'open': 16701.0,
   'vol': 98779.218199},
  {'amount': 8.0757,
   'close': 16740.33,
   'count': 69,
   'high': 16742.16,
   'id': 1513822560,
   'low': 16700.0,
   'open': 16742.08,
   'vol': 134886.3303585871},
  {'amount': 2.3452195694932483,
   'close': 16700.18,
   'count': 50,
   'high': 16742.29,
   'id': 1513822500,
   'low': 16700.0,
   'open': 16718.0,
   'vol': 39170.848179},
  {'amount': 1.246769777612415,
   'close': 16700.72,
   'count': 64,
   'high': 16757.77,
   'id': 1513822440,
   'low': 16699.71,
   'open': 16718.0,
   'vol': 20842.39121918},
  {'amount': 4.961576788744247,
   'close': 16718.6,
   'count': 84,
   'high': 16723.96,
   'id': 1513822380,
   'low': 16695.64,
   'open': 16695.68,
   'vol': 82859.76045131701},
  {'amount': 3.971461816414493,
   'close': 16695.68,
   'count': 107,
   'high': 16695.7,
   'id': 1513822320,
   'low': 16684.74,
   'open': 16684.94,
   'vol': 66285.78616880937},
  {'amount': 2.869202665632308,
   'close': 16684.94,
   'count': 104,
   'high': 16688.5,
   'id': 1513822260,
   'low': 16660.28,
   'open': 16687.1,
   'vol': 47878.90567668483}],
 'status': 'ok',
 'ts': 1513823455796}

In [22]:
json_data.keys()

dict_keys(['status', 'ch', 'ts', 'data'])

In [25]:
data_field = ['close']
candleline_data = DataFrame(json_data['data'], columns=data_field)
candleline_data

       close
0   16670.00
1   16702.24
2   16674.58
3   16703.05
4   16689.71
5   16690.00
6   16672.29
7   16695.27
8   16695.58
9   16705.57
10  16701.69
11  16737.99
12  16695.63
13  16700.18
14  16740.33
15  16700.18
16  16700.72
17  16718.60
18  16695.68
19  16684.94

In [26]:
# Interacting with database

In [27]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER );"""
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [28]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

con.executemany(stmt, data)
con.commit()

In [31]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [32]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [36]:
DataFrame(rows, columns=list(zip(*cursor.description))[0])
#note that zip(iteratable) returns a an iterable object, in order to make it subscriptable, use list(zip(*ngram))

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5